{
  "hero_text": "Graduated software engineer from the Netherlands, skilled in .NET technologies and more.",
  "hero_button": "Scroll down to discover more",
  "introduction": {
    "tooltip": "Hello World! A well-known phrase in the programming world, but for me, a beautiful phrase because I have seen so much in the world.",
    "text": "My name is Jop Bertrams, 21 years old, and in 2024 I graduated in ICT at Fontys University of Applied Sciences in Eindhoven. Currently I am working as a full-time software engineer at Gilde-BT Software in Blerick, Venlo. Through my studies and work experience, I have developed a strong foundation in various software development techniques. I would like to showcase some of the projects I have worked on, which demonstrate my capabilities in problem-solving, programming, and collaboration. I am excited to continue learning and growing as a software engineer and am always looking for new challenges and opportunities to improve my skills."
  },
  "timeline": {
    "header": "Timeline",
    "fontys": {
      "info": "Fontys",
      "text": "In 2019, I started my ICT studies at Fontys University of Applied Sciences in Eindhoven, focusing on software engineering."
    },
    "cybersecurity": {
      "info": "Cyber Security",
      "text": "During my studies, I specialized in Cyber Security for a semester, gaining knowledge in Ethical Hacking and Risk Consulting. I analyzed the security of various IT environments using common pentest tools such as Nmap, Metasploit, Wireshark, and Burp Suite. Additionally, I assessed security threats and business risks using risk analysis methods and advised a client on security improvements for an IT environment on physical, technical, and organizational levels."
    },
    "curacao": {
      "info": "Curacao",
      "text": "From February 2022 to July 2022 I did an internship software engineering in Curacao. This experience was unique and unforgettable, where I met amazing people and immersed myself in a vibrant culture. It was an opportunity to grow both personally and professionally, and I am grateful for the valuable memories and experiences."
    },
    "enterprisesoftware": {
      "info": "Enterprise Software",
      "text": "During a semester of enterprise software engineering, I learned all about scalable microservice architectures, cloud services, and Kubernetes. This challenging experience provided me with in-depth knowledge and practical skills that are highly valuable in my career as a software developer."
    },
    "southafrica": {
      "info": "South Africa",
      "text": "From February 2023 to June 2023, I delved into AI and Machine Learning at the Belgium Campus university in Pretoria, South Africa. During this period, I learned about various models and frameworks for creating advanced AI solutions. Besides academic enrichment, I also had the chance to experience the unique nature and culture of South Africa, from the breathtaking natural beauties such as Pilanesberg, Kruger Park, and Drakensberg to the vibrant cities such as Johannesburg and Cape Town."
    },
    "gilde-bt": {
      "info": "Gilde-BT",
      "text": "In September 2023, I started my final internship in software engineering at Gilde-BT Software in Blerick, Venlo. Here, I worked on an LLM (Large Language Model) module to extend an internal framework. The knowledge about AI and Machine Learning that I gained in South Africa came in handy during this internship and matched perfectly with my expertise. This internship lasted until January 2024 and marked the end of my HBO-ICT education. After my internship, I stayed at Gilde-BT Software as a full-time software engineer due to the good working atmosphere and the opportunity to further develop myself."
    },
    "future": {
      "info": "???",
      "text": "As a software engineer, I am excited about the limitless possibilities the future holds. I am determined to keep learning and growing in this dynamic field.",
      "year": "Future"
    }
  },
  "skills": "Skills",
  "projects": {
    "header": "Projects",
    "learnmore_button": "Learn more...",
    "description_header": "Description",
    "technologies_header": "Used technologies",
    "stakeholder_header": "Stakeholder",
    "safespace": {
      "logo": "images/safespace-logo.png",
      "title": "SafeSpace",
      "short_description": "SafeSpace is an all-in-one home security system that was created by a team of 6 students during the first semester. The system consists of both a desktop application for Windows and an application for iOS to control and monitor the hardware.",
      "description": [
        "SafeSpace is an all-in-one home security system that was created by a team of 6 students during the first semester. The system consists of both a desktop application for Windows and an application for iOS to control and monitor the hardware. The desktop application was made using a WinForm application. This application gave the end-user the possibilities to monitor the cameras around the house, lock and unlock the doors, see if there is any motion inside, see details about your smart doorbell and monitor the temperature and humidity inside.",
        "We also made every hardware aspect of the system ourself in our prototype. There was a Raspberry Pi that was used to connect the cameras to the on premise server and stream the feed, while there was also a MQTT server running to receive all the data in the house. For all the different sensors and the doorbell we used an Arduino Mega to read the data and send it to the MQTT server. A LCD screen was used to display a short status inside the house."
      ],
      "images": [
        "images/safespace-dashboard.png",
        "images/safespace-lock.gif",
        "images/safespace-motion.gif",
        "images/safespace-cam.png",
        "images/safespace-ring.png",
        "images/safespace-temp.png",
        "images/safespace-lcd1.jpg",
        "images/safespace-lcd2.jpg",
        "images/safespace-basement.jpg"
      ],
      "technologies": [
        "Windows Forms .NET Framework: 4.7.2",
        "Xamarin iOS",
        "Raspberry Pi 3B+",
        "MQTT Protocol",
        "Arduino Mega",
        "DT11 Temperature and Humidity Sensor",
        "HC-SRO4 Ultrasonic Sensor",
        "KY-006 Buzzer",
        "LCD Display"
      ],
      "stakeholder": "Fontys University of Applied Sciences",
      "stakeholder_link": "https://fontys.edu/Bachelors-masters/Bachelors/Information-Communication-Technology-Eindhoven.htm"
    },
    "chatbot": {
      "logo": "images/chatbot-logo.png",
      "title": "Chatbot",
      "short_description": "The second project in my first year of ICT & Software Engineering is a chatbot created for people who may live in loneliness and/or social isolation. The chatbot had to be easily accessible for seniors without extensive knowledge of computers.",
      "description": [
        "The second project in my first year of ICT & Software Engineering is a chatbot made for people who might be lonely. The chatbot had to be easily accessible for seniors without extensive computer knowledge. The chatbot was made using the Microsoft Bot Framework and was hosted on Azure. The chatbot was made in a team of 4 students.",
        "The bot made use of Microsoft Language Understanding (LUIS), a cloud-based conversational AI service that applied our custom machine-learning intelligence made for this project. The bot was able to understand the user's intent with corresponding entities and respond accordingly. When you wanted to share your name and age with the bot, it would make the conversation more personal, but if you preferred to stay anonymous, the bot would still be able to help you.",
        "The bot was able to ask you questions about your social life and give you a score based on your answers. The bot was also able to give you tips on how to improve your social life."
      ],
      "images": [
        "images/chatbot-welkom.png",
        "images/chatbot-naam.png",
        "images/chatbot-geennaam.png",
        "images/chatbot-contact.png",
        "images/chatbot-eenzaam.png",
        "images/chatbot-uitslag.png"
      ],
      "technologies": [
        "Microsoft Bot Framework",
        "Microsoft Language Understanding (LUIS)",
        "Microsoft Azure",
        "Bot Framework Emulator",
        "MySQL"
      ],
      "stakeholder": "Eindhoven in Contact",
      "stakeholder_link": "https://www.eindhovenincontact.nl/"
    },
    "flightassistant": {
      "logo": "images/flightassistant-logo.png",
      "title": "FlightAssistant",
      "short_description": "FlightAssistant is a web application that allows customers to book flights and manage their bookings afterwards. It is designed to make the process of booking and managing flights of multiple airlines easy and convenient for the user in one place.",
      "description": [
        "FlightAssistant is a web application that allows customers to book flights and manage their bookings afterwards. It is designed to make the process of booking and managing flights of multiple airlines easy and convenient for the user in one place. The application was an individual project besides the chatbot project. On the page with all flights you would see an overview of all the flights that are upcoming. This overview contains the departure location, destination, date and time, the airline and the price. When you click on the Details button beside the flight you would be redirected to the details page of that flight. Here you would see all the details of the flight, including more details about the locations and the airline. On the side you see the route of the flight. From this page you are able to go to the booking process for this flight. When the process is finished you would be redirected to the invoice page. Here you would see all the details of the flight and the booking. You would also be able to download the invoice as a PDF.",
        "The application was made using the ASP.NET Core MVC framework and the database was made using MySQL. This database contained every airline, airport and route in the world. The administrator could easily add flights to the application using this information."
      ],
      "images": [
        "images/flightassistant-allflights.png",
        "images/flightassistant-flightdetails.png",
        "images/flightassistant-bookflight.png",
        "images/flightassistant-invoice.png",
        "images/flightassistant-db.png"
      ],
      "technologies": ["ASP.NET Core MVC", "Bootstrap", "MySQL"],
      "stakeholder": "Fontys University of Applied Sciences",
      "stakeholder_link": "https://fontys.edu/Bachelors-masters/Bachelors/Information-Communication-Technology-Eindhoven.htm"
    },
    "lokawin": {
      "logo": "images/lokawin-logo.png",
      "title": "LokaWin",
      "short_description": "LokaWin (Lokaal Winkelen), is a full-stack web application where users can order products from multiple stores in their region in one central place to have them delivered to their home.",
      "description": [
        "LokaWin (Lokaal Winkelen), is a full-stack web application where users can order products from multiple stores in their region in one central place to have them delivered at home at the same time. You can compare the platform slightly to Amazon, where every store can sign up to sell items trough this platform, but instead of the end-user ordering products from all over the world, you can order products from local stores in your area to support local businesses.",
        "Everyone can see the map with all affiliated stores without signing up to see what stores are available in their area. When you sign up you can see all the products of the stores, sort stores by category or sort the products by category. On your personal profile page you can see a history of all your orders, see your favorite stores and products, look at your recent searches or change your personal details.",
        "The frontend of the application was made using Vue.js and the backend was made using Node.js and Express.js. For the database I used MongoDB, which was connected to the backend using Mongoose. The application was hosted on a server at home, and got automatically deployed to the server when I pushed to the GitHub repository."
      ],
      "images": [
        "images/lokawin-startpage.png",
        "images/lokawin-map.png",
        "images/lokawin-signup.png",
        "images/lokawin-userdetails.png",
        "images/lokawin-allstores.png",
        "images/lokawin-drugstores.png",
        "images/lokawin-allproducts.png"
      ],
      "technologies": [
        "Vue.js",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Mongoose",
        "Bootstrap",
        "Leaflet"
      ],
      "stakeholder": "Fontys University of Applied Sciences",
      "stakeholder_link": "https://fontys.edu/Bachelors-masters/Bachelors/Information-Communication-Technology-Eindhoven.htm"
    },
    "smartassettracking": {
      "logo": "images/smartassettracking-logo.png",
      "title": "Smart Asset Tracking",
      "short_description": "Smart Asset Tracking is a service consisting of a web application and a mobile application. The web application is used by the back office of the company to track the vans transporting the assets. The mobile application is used by the drivers of the vans to send the location of the van and the temperature of the loading space to the back office.",
      "description": [
        "Smart Asset Tracking is a service consisting of a web application and a mobile application. The web application is used by the back office of the company to track the vans transporting the assets and monitoring the temperature and humidity from the back of the van. The mobile application is used by the drivers of the vans to send the location of the van and the temperature of the loading space to the back office. The back office can see the location of the vans on a map. When the temperature is too high or too low, the back office and the driver will receive a notification. The back office can also see the history of the temperature of the loading space.",
        "I mostly worked on the mobile application this project. This application was made with Xamarin. The application was connected to a RuuviTag sensor in the back of the van over Bluetooth Low Energy to get the temperature and humidity. The application also used the GPS of the phone to get the location of the van. The application was connected to the back office using a REST API.",
        "The frontend of the back office application was made using React, and the backend using ASP.NET Core Web API. This backend stored all the information of the vans and the drivers in a MySQL database."
      ],
      "images": [
        "images/smartassettracking-homescreen.png",
        "images/smartassettracking-monitoring.png",
        "images/smartassettracking-notifications.png",
        "images/smartassettracking-selectdevice.png",
        "images/smartassettracking-backoffice.png",
        "images/smartassettracking-warning.gif"
      ],
      "technologies": [
        "Xamarin",
        "ASP.NET Core Web API",
        "React",
        "MySQL",
        "RuuviTag sensor"
      ],
      "stakeholder": "OrangeNXT on behalf of HelloFresh",
      "stakeholder_link": "https://www.orangenxt.com/en"
    },
    "carrental": {
      "logo": "images/carrental-logo.png",
      "title": "Car Rental",
      "short_description": "During my internship in Curacao I did research on low-code and no-code platforms. I created a car rental application using the Mendix and OutSystems platforms. The application allows customers to book a rental car and manage their bookings afterwards.",
      "description": [
        "During my internship on Curacao I did research on low-code and no-code platforms. After extensive research I chose to create a prototype application using what at that time where the best low-code platforms in my opinion, Mendix and OutSystems. To make a prototype with complex enough logics and some algorithms to properly test these platforms I created a car rental application.",
        "When the user visits the website they can see every car in the fleet and search for available car for a specific date range. After selecting a car they can choose which extras they want to add to their booking and which insurance they want to take. After filling in their personal details and verifying their booking they can pay for their booking. When this process is finished the user can see all their bookings on the My Bookings page.",
        "When you login using an admin account you can see all the cars in the fleet, add cars, edit cars and change the prices of the cars. When you add high season dates the customer will pay an extra fee for the car during these dates. When you want to change the prices per day of all the extras and insurances this is also possible from this page. In the Bookings tab you can see all the past, and upcoming bookings. When you click on a booking you can see all the details of the booking and you can add a note to the booking."
      ],
      "images": [
        "images/carrental-homepage.png",
        "images/carrental-availablecars.png",
        "images/carrental-bookingextras.png",
        "images/carrental-bookingverify.png",
        "images/carrental-bookingpayment.png",
        "images/carrental-mybookings.png",
        "images/carrental-admincars.png",
        "images/carrental-highseason.png",
        "images/carrental-changeprices.png",
        "images/carrental-adminbookings.png",
        "images/carrental-adminbookingdetails.png",
        "images/carrental-editcar.png"
      ],
      "technologies": ["Mendix", "OutSystems"],
      "stakeholder": "Zion Tech B.V.",
      "stakeholder_link": "https://ziontech.biz/"
    },
    "kwetter": {
      "short_description": "In semester 6, enterprise software engineering, I created a Twitter clone using a microservice architecture, and deployed this to a Kubernetes cluster on a cloud platform."
    },
    "oefenpraktijk": {
      "short_description": "In semester 6 I also worked on a group project with 4 other students, where we created a web application for mental healthcare workers to find each other and share their experiences and knowledge on certain topics."
    }
  },
  "contact": {
    "header": "Contact",
    "text": "I am always looking for new opportunities to work with interesting people and companies. If you think we could be a good fit, please don't hesitate to send me a mail."
  }
}
